[  {
  "name": "KUAN SUN",
  "alt": "KUAN SUN",
  "position": "Senior Analyst",
  "src": "lp-assets/img/headshots/squares/Kuan_Sun_LFE.png",
  "link":"https://www.linkedin.com/in/sunkuan/",
  "bio": "He is an integral part of the LFE technical team. Kuan acts as a senior analyst at LFE. He holds a PHD in Financial Engineering from City University of Hong Kong and obtained his BS in Finance & Banking (Hons) from Zhejiang University. Kuan was previously a research analyst at Bain & Co and an equity analyst at Citic Securities. He is a financial derivatives technician and practitioner. He excelled academically, being a former Mathematics Olympic Champion of China."
},
  {
    "name": "BENJAMIN LEIGH-HUNT",
    "alt": "BENJAMIN LEIGH-HUNT",
    "position": "Main Board Advisor, Strategic Planning & Development",
    "src": "lp-assets/img/headshots/squares/Benjamin_Leigh-Hunt_LFE.png",
    "link": "https://www.linkedin.com/in/ben-l-hunt-597767140/",
    "bio": "As a seasoned fund manager Ben has maintained the role of Chief Investment Officer at a multifamily office platform overseeing $2b USD AUM for the last 10 years. He has specialised in event driven and special situations strategies on a global basis. He is adept at designing structured finance solutions to achieve alpha generative returns through balance sheet optimization. He is a keen student of politics and history, possessing an entrepreneurial flare for entering new markets via the creation of innovative financial products."
  },
  {
    "name": "CHARLES PITTAR",
    "alt": "CHARLES PITTAR",
    "position": "Corporate CEO",
    "src": "lp-assets/img/headshots/squares/Charles_Pittar_LFE.png",
    "link": "https://www.linkedin.com/in/charles-pittar-a4a452b2/",
    "bio": "Charles has a distinguished career as a dynamic thought leader. His former roles include COO at Macquarie Bank (Asia), Asia regional roles with Citigroup and Goldman Sachs. Charles started his career at Microsoft cementing his technology expertise and latterly becoming CEO of Innovative Chinese tech powerhouse Juwai.com. As a thought leader, Charles has become a frequent expert contributor on Bloomberg and CNBC respectively. Charles is a keen sports fan and is the key LFE leader in Asia."
  },


  {
    "name": "SCOTT SMITH",
    "alt": "SCOTT SMITH",
    "position": "Football CEO",
    "src": "lp-assets/img/headshots/squares/Scott_Smith_LFE.png",
    "link": "https://www.linkedin.com/in/scott-smith-25613258/",
    "bio": "Prior to founding Raps Management in 2012, Scott was playing professional football for LA Galaxy where he won the League title in his first full season. After retiring from an illustrious professional football career, Scott founded a sports, entertainment and marketing management group which has become one of the foremost agencies in the UK and continental Europe. He specialises in building and maintaining the highest profile relationships within the sports, media and entertainment industries ranging from sports brands to TV networks allowing his client base to benefit from the impeccable reputation and track record that Scott has built."
  },

  {
    "name": "DANNY STROUD",
    "alt": "DANNY STROUD",
    "position": "UK Partnerships & Projects Manager",
    "src": "lp-assets/img/headshots/squares/Danny_Stroud_LFE.png",
    "link": "https://www.linkedin.com/in/dannystroud33/",
    "bio": "Danny joins LFE after both successfully working for UCFB (University College of Football Business) at both Wembley Stadium in London and the Etihad Stadium in Manchester. Danny has previously held roles with Millwall Football Club, The Hong Kong Football Association and the Football Association of England. He holds a degree in Football Business & Finance and has also played football at West Ham Utd centre of excellence thus understands both the on and off pitch permutations of sports combined with business, media and entertainment."
  },
  {
    "name": "FLYNN KENNEDY",
    "alt": "FLYNN KENNEDY",
    "position": "Business Development Manager",
    "src": "lp-assets/img/headshots/squares/Flynn_Kennedy_LFE.png",
    "link": "https://www.linkedin.com/in/flynn-kennedy-590901a5/",
    "bio": "Flynn has worked at Investrport as Global Business Development Manager and was instrumental in the conception of the LFE project. He is a naturally gifted sales and marketing professional with a particular flair for building relationships across borders and cultures. He graduated from the University of Newcastle with distinctions in Sport Business Management and has represented Hong Kong rugby at an international level which has enabled Flynn to become a natural leader within the LFE team."
  },
  {
    "name": "IRFAN BILIC",
    "alt": "IRFAN BILIC",
    "position": "European Football Development Manager",
    "src": "lp-assets/img/headshots/squares/Irfan_Bilic_LFE.png",
    "link": "https://www.linkedin.com/in/irfan-bilic-b69a397b/",
    "bio": "Irfan is a former professional footballer hailing from the Balkan region and playing at FC Zeljeznicar. Since finishing his playing career he has developed a particular expertise in sports law and finance related to European club development. He is an accomplished coach and scout and is curranty completing his UEFA coaching badges. Irfan is currently managing club relationships for the LFE in Central, Eastern and Northern Europe with an emphasis on raising awareness towards the LFE youth development philosophy."
  },
  {
    "name": "BRUCE GRIFFIN",
    "alt": "BRUCE GRIFFIN",
    "position": "Head of Business Development Asia Pacific",
    "src": "lp-assets/img/headshots/squares/Bruce_Griffin_LFE.png",
    "link":"https://www.linkedin.com/in/bruce-griffin-28428016/",
    "bio": "Bruce has in excess of 2o years’ experience at the height of his profession as a leading advisor to a number of Hong Kong and Australian based family offices and ultra-high net worth individuals, investment banks, state owned enterprises. His expertise is the business development and strategic development of multi-national businesses. Given that Bruce is a qualified Australian corporate lawyer and holds a Juris Doctor in Law (Hons) he is adept at negotiating across multi-jurisdictional legal framework."
  },
  {
    "name": "ALEX CLERICY",
    "alt": "ALEX CLERICY",
    "position": "Business Development France, Monaco, Italy",
    "src": "lp-assets/img/headshots/squares/Alex_Clericy_LFE.png",
    "link": "https://www.linkedin.com/in/alexclericy/",
    "bio": "Alex began his career as a professional racing driver. Alex was formerly a project manager at Edmiston Yachts in Monaco and has developed an impressive network of contacts in the media, sporting, business and philanthropic circles. Alex became Head of Business Development for Monaco for Investrport and was instrumental in the conception of the LFE project and as a co-founder has been involved with shaping the strategy and development of the LFE business model."
  },

  {
    "name": "AXEL KRUEGER",
    "alt": "AXEL KRUEGER",
    "position": "Finance, Corporate, Compliance Board Advisor",
    "src": "lp-assets/img/headshots/squares/Axel_Krueger_LFE.png",
    "link": "https://www.linkedin.com/in/axelkrueger/",
    "bio": "Axel brings in excess of 2o years experiences with a commodity industry specialisation and as an expert practitioner within various financial institutions. He has had an illustrious career at some of the most respected trailblazers and industry pioneers such as MRI Trading AG, Fortis Bank and Noble Europe. Axel’s expertise lay in the field of financial structuring, balance sheet optimisation, corporate governance and the ability to operate in a multi-jurisdictional organisation maintaining impeccable compliance and corporate governance standards whilst thriving within a high-pressure atmosphere."
  },
  {
    "name": "KONSTANTINOS GHERTSOS",
    "alt": "KONSTANTINOS GHERTSOS",
    "position": "Main Board Advisor, Strategic Planning & Development",
    "src": "lp-assets/img/headshots/squares/Konostantinos_Ghertsos_LFE.png",
    "link": "https://www.linkedin.com/in/konstantinos-ghertsos-534b8633/",
    "bio": "Having studied Oceanography and completing his Ph.D. degree in Biological Oceanography from the University of Paris, his vision was to support and embrace forward thinking commercial ideas harnessing the potential for positive change. Kostas has become a trusted adviser to Swiss based family office Alpha Three Invest and is dedicated to encouraging the creation of innovative commercial, yet philanthropic ventures for a more just approach to investment within the Environmental, social and governance (ESG) framework."
  },
  {
    "name": "JIM AYLWARD",
    "alt": "JIM AYLWARD",
    "position": "Media & Entertainment Advisor",
    "src": "lp-assets/img/headshots/squares/Jim_Aylward_LFE.png",
    "link": "https://www.linkedin.com/in/james-aylward-564b0897/",
    "bio": "Jim began his career in the media and entertainment industry, He has since honed his media investment expertise through assisting various venture stage projects and companies. Jim has become adept at managing and building relationships within the corridors of influence within the media and entertainment industry and has become an indispensable component of the LFE Strategy implementation."
  },
  {
    "name": "JEREMY DRZAL",
    "alt": "JEREMY DRZAL",
    "position": "ITO Advisor & Director Global Operations",
    "src": "lp-assets/img/headshots/squares/Jeremy_Drzal_LFE.png",
    "link": "https://www.linkedin.com/in/jdrzal/",
    "bio": "Jeremy Drzal is Founder & CEO of BLOCK512 and ITO Advisor. Jeremy leads marketing and operations, as well as the global ICO Advisor and ICO Ambassador network. Jeremy brings an innovative approach to identifying and executing growth strategies for advanced technologies enabling secure and smart connected commerce. His experience spans many verticals including Fintech, RegTech, Retail, IoT, and Smart Cities across a network of clients and partners in 50 countries. He actively manages the BLOCK512 media network along with highly-engaged social media channels and LinkedIn Groups with over 100,000 people worldwide."
  },
  {
    "name": "JON SMITH",
    "alt": "JON SMITH",
    "position": "Football Club Relationship Advisor",
    "src": "lp-assets/img/headshots/squares/Jon_Smith_LFE.png",
    "link": "https://twitter.com/jon1startist?lang=en",
    "bio": "With 40 years’ experience Jon is known as the first Football ‘Superagent’. En route he has worked with some of the biggest sports stars in the world such as Diego Maradona and Lord Sebastian Coe, managed the off-pitch activities of the England Football Team for 10 years ultimately creating ‘Team England’ which is the vehicle used by the Football Association and the England Football Team to this date; He was the first promoter of all the North American sports in the UK (NBA, MLB, NFL and NHL) including the major early NFL games at Wembley – He also owned the London Monarchs (in the World Bowl winning season). He has also been very successfully involved in the record business and theatre business, at one time owning the largest theatre marketing businesses in London and New York. He is a regular guest on BBC News, ITN News at Ten, Newsnight, Sky News, Bloomberg, ABC, NBC, CBS and various TV networks around the world."
  },
  {
    "name": "DARRAGH MACANTHONY",
    "alt": "DARRAGH MACANTHONY",
    "position": "Football Business Expert",
    "src": "lp-assets/img/headshots/squares/Darragh_Macanthony_LFE.png",
    "link": "https://twitter.com/DMAC102?lang=en",
    "bio": "Darragh Macanthony, is a successful entrepreneur. Within excess of 20 years’ experience. This period saw him employing over 3,500 people, servicing 30,000 clients globally transacting in excess of $4.5 Billion dollars’ worth of International Real estate including the construction of over 2000 properties as a property developer. At the age of 33 he retired from real estate to focus on his young family and portfolio of sporting investments which led him to relocating from Europe to Florida, USA. 2006 – At 30 he became the youngest owner and Chairman in English Football League History when he purchased Peterborough United Football Club (http://www.theposh.com). His ten years owning the football club has seen the club enjoy much success including 3 promotions, 1 Major Cup Final Victory, reaching the league Plays offs, multiple years one league below the Premier League in the EFL Championship, this is a considerable achievement given the financial profile of Peterborough United compared with the majority of the Championship constituents. For perspective, they have consistently been one of the top 30 clubs out of 72 league clubs over his 10-year stewardship. 2007 – He was added to the ‘Sunday Times Rich List’ at the age of 30. Darragh has philanthropic interests such as; setting up The Helping Hands Group in the UK, which was set up to help adults with severe learning difficulties (thehelpinghandsgroup.org.uk) of which he remains Chairman since. He is a patron of the Free Kicks Foundation (freekicksfoundation.org) which is a charity set up to help young children with illnesses and one he contributes to. He makes regular TV appearances on various Sky and BT Sports shows in the UK on football related matters over the last 10 years. In 2012 Darragh released a best-selling book ‘From Hobby to Obsession’, based on his experiences as a football club owner and chairman which has received critical acclaim for its candidness and the looking glass into an otherwise very closed segment of the football industry."
  },
  {
    "name": "EDWIN CARLSON",
    "alt": "EDWIN CARLSON",
    "position": "Technology Advisor & Blockchain Specialist",
    "src": "lp-assets/img/headshots/squares/Edwin_Carlson_LFE.png",
    "link": "https://www.linkedin.com/in/blockchainedwin/",
    "bio": "Edwin Carlson is CEO of SmartBit Auto where consumers can purchase their next vehicle online. SmartBit uses blockchain technology to record the ownership and financial details of each car sale. He has extensive experience working with blockchain technology and FinTech, he teaches the “Blockchain and Business” course to industry executives both online and in person around the world. Edwin has consulted on FinTech strategy for JPMorganChase, Bank of America, Royal & Sun Alliance and HSBC. Edwin holds a BSc in Computer Studies (Hons)."
  },
  {
    "name": "MINAZ SARANGI",
    "alt": "MINAZ SARANGI",
    "position": "LFE Technology & ITO Advisor",
    "src": "lp-assets/img/minaz-saragiShadow.png",
    "link": "https://www.linkedin.com/in/minaz-sarangi-76a6b5",
    "bio": "Minaz Sarangi is regarded as a Global Thought Leader and Technology Visionary. Minaz has over 30 years of experience as an Executive, CIO, CTO & Chief Architect delivering technology projects globally with impressive results in Banking, Insurance & Fintech Start-ups. He currently advises organizations and Boards with a focus on Digital Transformation, Blockchain, Crypto Currency and AI technologies using innovative design concepts and strategies. Minaz began his career with Lombard Insurance and quickly progressed to the role of Director of Application Development.  Minaz joined Zurich Financial Services as VP, Application Development & Transformation delivering major platforms during his tenure. Minaz then joined ING Canada as VP, Architecture, Security & Shared Services and was later promoted to Chief Architect of ING Group based in Amsterdam. His next role took him back to Canada as the SVP, Chief Architect & CIO, Shared Services for TD Bank. His next opportunity was to work for the Fintech startup Mozido, as EVP & CIO where he was a critical member of the Executive team that raised $285M in funding and delivery of numerous Global projects. At Mozido, Minaz & his team filed patents in the payments space and his teams have won several Technology Industry awards in the financial services sector."
  },
  {
    "name": "KSHITISH BALHOTRA, MBA",
    "alt": "KSHITISH BALHOTRA, MBA",
    "position": "ITO Technology Advisor & Blockchain Specialist",
    "src": "lp-assets/img/headshots/squares/Kshitish_Balhotra_LFE.png",
    "link": "https://www.linkedin.com/in/kshitishb/",
    "bio": "Kshitish is a BLOCK512 ITO Advisor and Director for Strategic Product Development and Management. He brings global experience to in-house and client-specific product teams supporting Blockchain, Cryptocurrency and Smart contracts across North America and Asia-Pacific markets. Kshitish is a Fintech thinker and blockchain expert with a keen understanding of market needs and ability to simplify the business aspects of complex technology innovations and program delivery for clients. He has held key leadership positions across the globe at leading financial firms including Barclays, Standard Chartered, TD, RBS where he has honed his ability to ideate, manage and deliver complex tech products and innovations."
  },
  {
    "name": "NICK O'HERN",
    "alt": "NICK O'HERN",
    "position": "ITO Ambassador, Former PGA Golfer, & Author",
    "src": "lp-assets/img/headshots/squares/Nick_Ohern_LFE.png",
    "link": "https://www.linkedin.com/in/nick-o-hern-3a2bbb9a/",
    "bio": "Nick O'Hern is an Australian professional golfer now residing in the United States with his wife and two children. Having played golf on the biggest professional tours around the world for over 20 years, he now mentors aspiring amateur and professional golfers. Nick also conducts golf outings for select companies and individuals to entertain their clients. He writes for the Australian Golf Digest Magazine and recently published his first book, 'Tour Mentality - Inside the Mind of a Tour Pro' which sits in Golf Assessors 'Top 50 Best Books of All Time'. Nick's golf career highlights include victories in the 2006 Australian PGA Championship and 1999 Coolum Classic. He represented the International Team at two Presidents Cups and is the only man to defeat Tiger Woods twice in the WGC World Match Play Championship. From 2004 through 2008 he was ranked in the top 50 Official World Golf Rankings with a career high of 16."
  },






  {
    "name": "DANIEL DONEY",
    "alt": "DANIEL DONEY",
    "position": "LFE Technology & ITO Advisor",
    "src": "lp-assets/img/headshots/squares/DanDoney.png",
    "link": "https://www.linkedin.com/in/ddoney/",
    "bio": "Dan Doney is the CEO of Securrency, Inc, a RegTech/FinTech company that democratizes access to the capital markets through the use of distributed ledger technologies and a patent pending global compliance framework. Prior to founding Securrency, Dan served as the US intelligence community’s first Chief Innovation Officer. He implemented an aggressive Innovation Strategy, the first of its kind in government, to support the rapid fielding of emerging technology and enhance agency execution agility. Earlier in his career at the National Security Agency, Dan served as technical lead on the Novel Intelligence from Massive Data (NIMD) research program, a seminal program in AI, machine learning, and natural language processing. He received the 2014 Federal Fierce 15 award for his work as a change agent in government. He is an avid software developer active in cloud computing, microservices, and blockchain development. Dan graduated from the U.S. Naval Academy in 1992 with a B.S. in Control Systems Engineering and an additional major in Economics, and received an M.S. in Nuclear Engineering from MIT in 1994."
  },
  {
    "name": "JUSTIN HADGKISS",
    "alt": "JUSTIN HADGKISS",
    "position": "ITO Advisor, International Compliance & Risk",
    "src": "lp-assets/img/headshots/squares/JustinHadgkiss.png",
    "link": "https://www.linkedin.com/in/hadgkiss/",
    "bio": "... stays ahead of forthcoming changes like GDPR and continues to expand the scope of KYC/AML capabilities. He is an emerging markets specialist with ten years’ experience in program management, technology project management, business analysis and strategy across Asia-Pacific. His previous work includes implementing go-to-market plans for mobile at Visa, a 5-year technology strategy plan with Boston Consulting Group for ANZ Asia-Pacific, and strategy for ANZ Bank – Vietnam and Cambodia. He has mobile payment expertise having worked in both the building and operations of Wave Money (Myanmar), WING (Cambodia), and on the vendor side of mobile money (for Fundamo and Visa) regionally. Justin holds a BIS Honours in Information Security, Computer Security Incident Response and Information Risk Management as well as a double BS in Information Systems and Psychology."
  },
  {
    "name": "JOHN HENSEL",
    "alt": "JOHN HENSEL",
    "position": "ITO Advisor International Markets",
    "src": "lp-assets/img/headshots/squares/JohnHensel.png",
    "link": "https://www.linkedin.com/in/john-hensel-37149b46/",
    "bio": "John Hensel currently serves as Securrency, Inc. COO and Senior Executive Officer for Securrency Middle East North Africa (MENA) Operations in Dubai, UAE. John leads a global team of SaaS developers and compliance specialists delivering RegTech, FinTech, and distributed ledger services solutions. Prior to co-founding Securrency in 2015, John served in executive leadership and senior program management positions with the U.S. Navy. His uniformed career spanned 25 years with extensive experience leading cross functional teams to include international business development efforts managing portfolios valued in excess of $15B.  He holds a B.S. in Physics from the U.S. Naval Academy, an M.B.A. from John Hopkins University, and an M.A. from the Naval War College."
  },

  {
    "name": "KATIE OLVER",
    "alt": "KATIE OLVER",
    "position": "Communications Director",
    "src": "lp-assets/img/headshots/squares/Katie_Olver.png",
    "link": "https://www.linkedin.com/in/katie-olver-606291",
    "bio": "Longtime tech publicist, Katie Olver is founder and CEO of Cryptoland PR. Katie and her team oversee the publicity for the world’s largest and most promising blockchain companies. As well as continually delivering mainstream coverage across the globe, the team have helped clients raise millions of dollars in fundraising, and Katie uses her extensive technology background to elevate awareness of the potential of blockchain technology to disrupt every industry."
  },
  {
    "name": "SPENCER CRANE",
    "alt": "SPENCER CRANE",
    "position": "Project Lead Managing Product Development",
    "src": "lp-assets/img/headshots/squares/SpencerCrane.png",
    "link": "https://www.linkedin.com/in/spencerncrane",
    "bio": "Spencer Crane joined Securrency in 2017 as a Project Lead managing product development, scaling, and operations. He has expertise in blockchain and smart contract development, and extensive experience in the development of marketplaces and exchange technology, having previously managed the development of an Ethereum-based peer-to-peer financial derivatives system and a syndication software for alternative investments. Spencer ensures the entire LFE ecosystem scales while managing day-to-day development and refinement of the user experience. Prior to Securrency, Spencer served in a variety of capacities including leadership and technical roles in startups and the public sector, consulting with more than 30 startups and “beenups” on scalability and growth while simultaneously running a successful real estate investment advisory firm focused on distressed real estate. He has founded three technology startups – two focused on financial technology, one of which is backed by Fidelity Information Services (NYSE: FIS). Spencer’s undergraduate studies were in Economics and Mathematics at Wayne State University."
  },

  {
    "name": "HOUSTON GOLDEN",
    "alt": "HOUSTON GOLDEN",
    "position": "ITO Advisor & Marketing Director",
    "src": "lp-assets/img/headshots/squares/HOUSTONGOLDEN.png",
    "link": "https://www.linkedin.com/in/houstongolden/",
    "bio": "Coming soon..."
  }





]
